app/controllers/hells_controller.rb

  def index
    @hells = Hell.all
---
SELECT "hells".* FROM "hells"

  def create
    @hell = current_user.Hell.new(hell_params)

    respond_to do |format|
      if @hell.save
---
INSERT INTO "hells" ("user_id", "top", "tas", "stat", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 10], ["top", "fkjdgfdgj"], ["tas", "dfkjfghkfgj"], ["stat", "kjfghgfh"], ["created_at", "2018-11-29 10:25:01.178510"], ["updated_at", "2018-11-29 10:25:01.178510"]]

  def update
    respond_to do |format|
      if @hell.update(hell_params)
---
UPDATE "hells" SET "tas" = ?, "stat" = ?, "updated_at" = ? WHERE "hells"."id" = ?  [["tas", "jfdgfd dfhdf sklfkdlsgj  lgj j dfjklfkjhgfkhljhfjgdklfg dkjhdgk dlhfd"], ["stat", "Not Done"], ["updated_at", "2018-11-29 14:00:10.497679"], ["id", 7]]

  def destroy
    @hell.destroy
---
DELETE FROM "hells" WHERE "hells"."id" = ?  [["id", 2]]

    def set_hell
      @hell = Hell.find(params[:id])
---
SELECT  "hells".* FROM "hells" WHERE "hells"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]