app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_hash") VALUES (?, ?, ?, ?)
---
  def create
      @user = User.new(user_params)
      respond_to do |format|
          if @user.save

UPDATE "users" SET "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_hash", "$2a$10$zBGhIAbRH19sYh2iyCSX/en3soe5hHGB.39uBdMCEjULBaBc.K8Ka"], ["updated_at", "2017-12-12 14:14:37.933398"], ["id", 2]]
---
  def update
      respond_to do |format|
          if @user.update(user_params)